#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_data_catalog_tag_template.data_ingestion will be created
  + resource "google_data_catalog_tag_template" "data_ingestion" {
      + display_name    = "Data Ingestion"
      + force_delete    = false
      + id              = (known after apply)
      + name            = (known after apply)
      + project         = (known after apply)
      + region          = (known after apply)
      + tag_template_id = "data_ingestion"

      + fields {
          + description  = "Data License"
          + display_name = "License"
          + field_id     = "license"
          + is_required  = true
          + name         = (known after apply)
          + order        = 0

          + type {
              + primitive_type = "STRING"
            }
        }
      + fields {
          + description  = "End-time of most recent ingestion job"
          + display_name = "Last ETL Job End"
          + field_id     = "latest_job_end_datetime"
          + is_required  = false
          + name         = (known after apply)
          + order        = 10

          + type {
              + primitive_type = "TIMESTAMP"
            }
        }
      + fields {
          + description  = "How long the most recent ETL job was running"
          + display_name = "Last ETL Job Runtime"
          + field_id     = "latest_job_run_time"
          + is_required  = false
          + name         = (known after apply)
          + order        = 9

          + type {
              + primitive_type = "STRING"
            }
        }
      + fields {
          + description  = "Name of the user to contact regarding ingestion issues and questions"
          + display_name = "Data Ingestion Owner"
          + field_id     = "data_ingestion_owner"
          + is_required  = false
          + name         = (known after apply)
          + order        = 13

          + type {
              + primitive_type = "STRING"
            }
        }
      + fields {
          + description  = "Specifies how many errors have occurred during most recent ETL job"
          + display_name = "Number of Errors"
          + field_id     = "errors"
          + is_required  = false
          + name         = (known after apply)
          + order        = 1

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      + fields {
          + description  = "Specifies how many warnings have occurred during most recent ETL job"
          + display_name = "Number of Warnings"
          + field_id     = "warnings"
          + is_required  = false
          + name         = (known after apply)
          + order        = 2

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      + fields {
          + description  = "Specifies the source of the data asset"
          + display_name = "Data Sources of ETL Job"
          + field_id     = "data_sources"
          + is_required  = false
          + name         = (known after apply)
          + order        = 8

          + type {
              + primitive_type = "STRING"
            }
        }
      + fields {
          + description  = "Specifies whether all source data contains PII"
          + display_name = "PII Data Sources"
          + field_id     = "data_sources_have_pii"
          + is_required  = false
          + name         = (known after apply)
          + order        = 6

          + type {
              + primitive_type = "BOOL"
            }
        }
      + fields {
          + description  = "Specifies whether all source data was approved"
          + display_name = "Data Sources Approved"
          + field_id     = "data_sources_approved_all"
          + is_required  = false
          + name         = (known after apply)
          + order        = 7

          + type {
              + primitive_type = "BOOL"
            }
        }
      + fields {
          + description  = "The number of rows that need reprocessing"
          + display_name = "Rows to Reprocess"
          + field_id     = "rows_for_reprocessing"
          + is_required  = false
          + name         = (known after apply)
          + order        = 3

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      + fields {
          + description  = "The number of rows/records added during the most recent ETL job run"
          + display_name = "Rows Added"
          + field_id     = "rows_added"
          + is_required  = false
          + name         = (known after apply)
          + order        = 4

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      + fields {
          + description  = "The number of rows/records ingested/processed during the most recent ETL job run"
          + display_name = "Rows Processed"
          + field_id     = "rows_processed"
          + is_required  = false
          + name         = (known after apply)
          + order        = 5

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      + fields {
          + description  = "The start-time of most recent ETL job"
          + display_name = "Last ETL Job Start"
          + field_id     = "latest_job_start_datetime"
          + is_required  = false
          + name         = (known after apply)
          + order        = 11

          + type {
              + primitive_type = "TIMESTAMP"
            }
        }
      + fields {
          + description  = "The status of the last ingestion job"
          + display_name = "Last ETL Job Status"
          + field_id     = "latest_job_status"
          + is_required  = false
          + name         = (known after apply)
          + order        = 12

          + type {
              + enum_type {
                  + allowed_values {
                      + display_name = "failed"
                    }
                  + allowed_values {
                      + display_name = "interrupted"
                    }
                  + allowed_values {
                      + display_name = "partial"
                    }
                  + allowed_values {
                      + display_name = "queued"
                    }
                  + allowed_values {
                      + display_name = "retrying"
                    }
                  + allowed_values {
                      + display_name = "running"
                    }
                  + allowed_values {
                      + display_name = "skipped"
                    }
                }
            }
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>